In [1]:
import cx_Oracle
import pandas as pd

In [2]:
con=cx_Oracle.connect('feb22_mounicka/feb22_mounicka@orcl-aws.c8sefhobaih4.ap-south-1.rds.amazonaws.com:1521/ORCL')
cur=con.cursor()

In [58]:
cur.execute("create or replace procedure sp_guests as cursor guest_exist is select name,phone,city from guests for update; v_cnt int; v_cnt1 int; begin for i in guest_exist loop select count(c_nm) into v_cnt from customer_guest where c_nm=i.name and c_phone=i.phone and c_city=i.city; if v_cnt=1 then delete guests  where current of guest_exist; else select count(c_nm) into v_cnt1 from call where c_nm=i.name and phone=i.phone and city=i.city; if v_cnt1=0 then insert into call values(seq_name.nextval,i.name,i.phone,i.city); update guests set pro_flg='y' where current of guest_exist; end if; end if; end loop; commit; end;")

In [67]:
cur.callproc('sp_guests')

[]

In [68]:
pd.read_sql('select *from call', con=con)

   CALL_ID   C_NM     PHONE CITY
0      185   bala     78939  chn
1      186   john    770260  blr
2      187  gundu  77026089  blr
3      188    tom   8555900  hyd

In [63]:
pd.read_sql('select * from customer_guest',con=con)

   C_ID    C_NM  C_PHONE C_CITY
0     1     raj    12345    blr
1     2    rani   989734    hyd
2     3    kimm   878384    chn
3     4  rajesh   783738    blr
4     5    arun   892393    del

In [69]:
pd.read_sql('select *from guests',con=con)

    NAME     PHONE CITY PRO_FLG
0   bala     78939  chn       y
1   john    770260  blr       y
2  gundu  77026089  blr       y
3    tom   8555900  hyd       y